Revit 2027 API
ParameterTypeId.RebarShapeCrankEndStraightLength Property
 "End Crank Straight Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeCrankEndStraightLength { get; }
Public Shared ReadOnly Property RebarShapeCrankEndStraightLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeCrankEndStraightLength {
	ForgeTypeId^ get ();
}
static member RebarShapeCrankEndStraightLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace